#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_logging_metric.md-website-500s["company1-prod"]: Refreshing state... [id=mdwebsite-company1-prod-500s]
data.google_iam_policy.md-website-no-auth: Reading...
google_service_account.md-website["company2-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/serviceAccounts/sa-cloudrun-company2-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_service_account.md-website["company2-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/serviceAccounts/sa-cloudrun-company2-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_logging_metric.md-website-500s["company2-stage"]: Refreshing state... [id=mdwebsite-company2-stage-500s]
google_service_account.md-website["company1-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/serviceAccounts/sa-cloudrun-company1-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_service_account.md-website["company1-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/serviceAccounts/sa-cloudrun-company1-stage@still-tower-474715-c6.iam.gserviceaccount.com]
data.google_iam_policy.md-website-no-auth: Read complete after 0s [id=3450855414]
google_logging_metric.md-website-500s["company1-stage"]: Refreshing state... [id=mdwebsite-company1-stage-500s]
google_logging_metric.md-website-500s["company2-prod"]: Refreshing state... [id=mdwebsite-company2-prod-500s]
google_pubsub_topic.mdconversions["stage"]: Refreshing state... [id=projects/still-tower-474715-c6/topics/mdconversions-stage]
google_pubsub_topic.mdconversions["prod"]: Refreshing state... [id=projects/still-tower-474715-c6/topics/mdconversions-prod]
google_service_account.md-converter["stage"]: Refreshing state... [id=projects/still-tower-474715-c6/serviceAccounts/sa-cf-md-converter-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_secret_manager_secret.secret-sauce["company2"]: Refreshing state... [id=projects/still-tower-474715-c6/secrets/company2-secret-sauce]
google_service_account.md-converter["prod"]: Refreshing state... [id=projects/still-tower-474715-c6/serviceAccounts/sa-cf-md-converter-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_secret_manager_secret.secret-sauce["company1"]: Refreshing state... [id=projects/still-tower-474715-c6/secrets/company1-secret-sauce]
google_monitoring_alert_policy.md-website["company2-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/alertPolicies/6285423501025501890]
google_monitoring_alert_policy.md-website["company1-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/alertPolicies/16149345700725966467]
google_monitoring_alert_policy.md-website["company1-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/alertPolicies/7262823815928818523]
google_monitoring_alert_policy.md-website["company2-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/alertPolicies/13742897250207337517]
google_storage_bucket.mdconversions["company2-stage"]: Refreshing state... [id=mdconversions-company2-stage]
google_storage_bucket.mdconversions["company1-stage"]: Refreshing state... [id=mdconversions-company1-stage]
google_storage_bucket.mdconversions["company1-prod"]: Refreshing state... [id=mdconversions-company1-prod]
google_storage_bucket.mdconversions["company2-prod"]: Refreshing state... [id=mdconversions-company2-prod]
google_project_iam_member.gar-reader["company1-stage"]: Refreshing state... [id=still-tower-474715-c6/roles/artifactregistry.reader/serviceAccount:sa-cloudrun-company1-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_project_iam_member.gar-reader["company2-prod"]: Refreshing state... [id=still-tower-474715-c6/roles/artifactregistry.reader/serviceAccount:sa-cloudrun-company2-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_project_iam_member.gar-reader["company1-prod"]: Refreshing state... [id=still-tower-474715-c6/roles/artifactregistry.reader/serviceAccount:sa-cloudrun-company1-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_project_iam_member.gar-reader["company2-stage"]: Refreshing state... [id=still-tower-474715-c6/roles/artifactregistry.reader/serviceAccount:sa-cloudrun-company2-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_pubsub_topic_iam_member.pubsub-publisher["company1-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/topics/mdconversions-stage/roles/pubsub.publisher/serviceAccount:sa-cloudrun-company1-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_pubsub_topic_iam_member.pubsub-publisher["company2-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/topics/mdconversions-prod/roles/pubsub.publisher/serviceAccount:sa-cloudrun-company2-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_pubsub_topic_iam_member.pubsub-publisher["company2-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/topics/mdconversions-stage/roles/pubsub.publisher/serviceAccount:sa-cloudrun-company2-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_pubsub_topic_iam_member.pubsub-publisher["company1-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/topics/mdconversions-prod/roles/pubsub.publisher/serviceAccount:sa-cloudrun-company1-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_project_iam_member.secret-reader["company2-stage"]: Refreshing state... [id=still-tower-474715-c6/roles/secretmanager.secretAccessor/serviceAccount:sa-cloudrun-company2-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_project_iam_member.secret-reader["company2-prod"]: Refreshing state... [id=still-tower-474715-c6/roles/secretmanager.secretAccessor/serviceAccount:sa-cloudrun-company2-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_project_iam_member.secret-reader["company1-prod"]: Refreshing state... [id=still-tower-474715-c6/roles/secretmanager.secretAccessor/serviceAccount:sa-cloudrun-company1-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_project_iam_member.secret-reader["company1-stage"]: Refreshing state... [id=still-tower-474715-c6/roles/secretmanager.secretAccessor/serviceAccount:sa-cloudrun-company1-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.gcs-reader["company2-prod"]: Refreshing state... [id=b/mdconversions-company2-prod/roles/storage.objectViewer/serviceAccount:sa-cloudrun-company2-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.gcs-reader["company1-stage"]: Refreshing state... [id=b/mdconversions-company1-stage/roles/storage.objectViewer/serviceAccount:sa-cloudrun-company1-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.gcs-reader["company2-stage"]: Refreshing state... [id=b/mdconversions-company2-stage/roles/storage.objectViewer/serviceAccount:sa-cloudrun-company2-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.gcs-reader["company1-prod"]: Refreshing state... [id=b/mdconversions-company1-prod/roles/storage.objectViewer/serviceAccount:sa-cloudrun-company1-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.md-converter-gcs-reader["company1-stage"]: Refreshing state... [id=b/mdconversions-company1-stage/roles/storage.objectCreator/serviceAccount:sa-cf-md-converter-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.md-converter-gcs-reader["company2-stage"]: Refreshing state... [id=b/mdconversions-company2-stage/roles/storage.objectCreator/serviceAccount:sa-cf-md-converter-stage@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.md-converter-gcs-reader["company2-prod"]: Refreshing state... [id=b/mdconversions-company2-prod/roles/storage.objectCreator/serviceAccount:sa-cf-md-converter-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_storage_bucket_iam_member.md-converter-gcs-reader["company1-prod"]: Refreshing state... [id=b/mdconversions-company1-prod/roles/storage.objectCreator/serviceAccount:sa-cf-md-converter-prod@still-tower-474715-c6.iam.gserviceaccount.com]
google_cloud_run_v2_service.md-website["company2-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company2-stage]
google_cloud_run_v2_service.md-website["company1-stage"]: Refreshing state... [id=projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company1-stage]
google_cloud_run_v2_service.md-website["company1-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company1-prod]
google_cloud_run_v2_service.md-website["company2-prod"]: Refreshing state... [id=projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company2-prod]
google_monitoring_dashboard.dashboard: Refreshing state... [id=projects/977121712073/dashboards/26322def-0498-4ec9-bbf2-2634c0e6ca06]
google_cloud_run_service_iam_policy.md-website-no-auth["company1-stage"]: Refreshing state... [id=v1/projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company1-stage]
google_cloud_run_service_iam_policy.md-website-no-auth["company1-prod"]: Refreshing state... [id=v1/projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company1-prod]
google_cloud_run_service_iam_policy.md-website-no-auth["company2-prod"]: Refreshing state... [id=v1/projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company2-prod]
google_cloud_run_service_iam_policy.md-website-no-auth["company2-stage"]: Refreshing state... [id=v1/projects/still-tower-474715-c6/locations/us-central1/services/mdwebsite-company2-stage]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

OpenTofu will perform the following actions:

  # google_cloud_run_service_iam_policy.md-website-no-auth["company3-prod"] will be created
  + resource "google_cloud_run_service_iam_policy" "md-website-no-auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-central1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "still-tower-474715-c6"
      + service     = "mdwebsite-company3-prod"
    }

  # google_cloud_run_service_iam_policy.md-website-no-auth["company3-stage"] will be created
  + resource "google_cloud_run_service_iam_policy" "md-website-no-auth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-central1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = "still-tower-474715-c6"
      + service     = "mdwebsite-company3-stage"
    }

  # google_cloud_run_v2_service.md-website["company3-prod"] will be created
  + resource "google_cloud_run_v2_service" "md-website" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "mdwebsite-company3-prod"
      + observed_generation     = (known after apply)
      + project                 = "still-tower-474715-c6"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling {
          + max_instance_count = 5
          + min_instance_count = 0
        }

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "sa-cloudrun-company3-prod@still-tower-474715-c6.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/still-tower-474715-c6/markdown-converter/md-website:latest"
              + name       = "md-website"

              + env {
                  + name  = "BUCKETNAME"
                  + value = "mdconversions-company3-prod"
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "prod"
                }
              + env {
                  + name  = "GCS_MOUNTPOINT"
                  + value = "/mnt/bucket"
                }
              + env {
                  + name  = "PUBSUB_TOPIC"
                  + value = "mdconversions-prod"
                }
              + env {
                  + name = "SECRETSAUCE"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "company3-secret-sauce"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 30
                  + period_seconds        = 300
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = 5000
                    }
                }

              + ports {
                  + container_port = 5000
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "2"
                      + "memory" = "4Gi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 1
                  + initial_delay_seconds = 0
                  + period_seconds        = 60
                  + timeout_seconds       = 60

                  + tcp_socket {
                      + port = 5000
                    }
                }

              + volume_mounts {
                  + mount_path = "/mnt/bucket"
                  + name       = "bucket"
                }
            }

          + volumes {
              + name = "bucket"

              + gcs {
                  + bucket    = "mdconversions-company3-prod"
                  + read_only = true
                }
            }
        }
    }

  # google_cloud_run_v2_service.md-website["company3-stage"] will be created
  + resource "google_cloud_run_v2_service" "md-website" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "mdwebsite-company3-stage"
      + observed_generation     = (known after apply)
      + project                 = "still-tower-474715-c6"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling {
          + max_instance_count = 3
          + min_instance_count = 0
        }

      + template {
          + execution_environment            = "EXECUTION_ENVIRONMENT_GEN2"
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "sa-cloudrun-company3-stage@still-tower-474715-c6.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/still-tower-474715-c6/markdown-converter/md-website:beta"
              + name       = "md-website"

              + env {
                  + name  = "BUCKETNAME"
                  + value = "mdconversions-company3-stage"
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "stage"
                }
              + env {
                  + name  = "GCS_MOUNTPOINT"
                  + value = "/mnt/bucket"
                }
              + env {
                  + name  = "PUBSUB_TOPIC"
                  + value = "mdconversions-stage"
                }
              + env {
                  + name = "SECRETSAUCE"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "company3-secret-sauce"
                          + version = "latest"
                        }
                    }
                }

              + liveness_probe {
                  + failure_threshold     = 3
                  + initial_delay_seconds = 30
                  + period_seconds        = 300
                  + timeout_seconds       = 1

                  + http_get {
                      + path = "/health"
                      + port = 5000
                    }
                }

              + ports {
                  + container_port = 5000
                  + name           = (known after apply)
                }

              + resources {
                  + cpu_idle          = true
                  + limits            = {
                      + "cpu"    = "1"
                      + "memory" = "2Gi"
                    }
                  + startup_cpu_boost = true
                }

              + startup_probe {
                  + failure_threshold     = 1
                  + initial_delay_seconds = 0
                  + period_seconds        = 60
                  + timeout_seconds       = 60

                  + tcp_socket {
                      + port = 5000
                    }
                }

              + volume_mounts {
                  + mount_path = "/mnt/bucket"
                  + name       = "bucket"
                }
            }

          + volumes {
              + name = "bucket"

              + gcs {
                  + bucket    = "mdconversions-company3-stage"
                  + read_only = true
                }
            }
        }
    }

  # google_logging_metric.md-website-500s["company3-prod"] will be created
  + resource "google_logging_metric" "md-website-500s" {
      + filter  = <<-EOT
            resource.type = "cloud_run_revision"
              AND resource.labels.service_name = "mdwebsite-company3-prod"
              AND log_name = "projects/still-tower-474715-c6/logs/run.googleapis.com%2Frequests"
              AND httpRequest.status >= 500
        EOT
      + id      = (known after apply)
      + name    = "mdwebsite-company3-prod-500s"
      + project = "still-tower-474715-c6"

      + metric_descriptor {
          + display_name = "mdwebsite-company3-prod 500s"
          + metric_kind  = "DELTA"
          + unit         = "1"
          + value_type   = "INT64"
        }
    }

  # google_logging_metric.md-website-500s["company3-stage"] will be created
  + resource "google_logging_metric" "md-website-500s" {
      + filter  = <<-EOT
            resource.type = "cloud_run_revision"
              AND resource.labels.service_name = "mdwebsite-company3-stage"
              AND log_name = "projects/still-tower-474715-c6/logs/run.googleapis.com%2Frequests"
              AND httpRequest.status >= 500
        EOT
      + id      = (known after apply)
      + name    = "mdwebsite-company3-stage-500s"
      + project = "still-tower-474715-c6"

      + metric_descriptor {
          + display_name = "mdwebsite-company3-stage 500s"
          + metric_kind  = "DELTA"
          + unit         = "1"
          + value_type   = "INT64"
        }
    }

  # google_monitoring_alert_policy.md-website["company3-prod"] will be created
  + resource "google_monitoring_alert_policy" "md-website" {
      + combiner        = "OR"
      + creation_record = (known after apply)
      + display_name    = "Cloud Run: mdwebsite-company3-prod"
      + enabled         = true
      + id              = (known after apply)
      + name            = (known after apply)
      + project         = "still-tower-474715-c6"
      + severity        = "WARNING"

      + alert_strategy {
          + auto_close = "604800s"
        }

      + conditions {
          + display_name = "Cloud Run: mdwebsite-company3-prod max_instances"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = <<-EOT
                    resource.type = "cloud_run_revision"
                      AND resource.labels.service_name = "mdwebsite-company3-prod"
                      AND metric.type = "run.googleapis.com/container/instance_count"
                      AND metric.labels.state = "active"
                EOT
              + threshold_value = 4

              + aggregations {
                  + alignment_period   = "300s"
                  + per_series_aligner = "ALIGN_MEAN"
                }

              + trigger {
                  + count = 1
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                Remediation is dependent on the condition that triggered the alert:
                
                ### Max Instances
                This alert is only to help monitor the current `max_instances` setting.
                Currently the service mdwebsite-company3-prod has `max_instances` set to 5.
                Might be worth bumping that up if this alert fires often.
                
                ### HTTP 500s
                This alert fires when the Cloud Run Service is returning many HTTP 500 status codes.
                Currently the alert will fire if the service returns `20` errors in a 5 minute span.
                This can indicate issues with the service or a dependency.
            EOT
          + mime_type = "text/markdown"
          + subject   = "Cloud Run: mdwebsite-company3-prod alert"
        }
    }

  # google_monitoring_alert_policy.md-website["company3-stage"] will be created
  + resource "google_monitoring_alert_policy" "md-website" {
      + combiner        = "OR"
      + creation_record = (known after apply)
      + display_name    = "Cloud Run: mdwebsite-company3-stage"
      + enabled         = true
      + id              = (known after apply)
      + name            = (known after apply)
      + project         = "still-tower-474715-c6"
      + severity        = "WARNING"

      + alert_strategy {
          + auto_close = "604800s"
        }

      + conditions {
          + display_name = "Cloud Run: mdwebsite-company3-stage max_instances"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "1800s"
              + filter          = <<-EOT
                    resource.type = "cloud_run_revision"
                      AND resource.labels.service_name = "mdwebsite-company3-stage"
                      AND metric.type = "run.googleapis.com/container/instance_count"
                      AND metric.labels.state = "active"
                EOT
              + threshold_value = 2

              + aggregations {
                  + alignment_period   = "300s"
                  + per_series_aligner = "ALIGN_MEAN"
                }

              + trigger {
                  + count = 1
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                Remediation is dependent on the condition that triggered the alert:
                
                ### Max Instances
                This alert is only to help monitor the current `max_instances` setting.
                Currently the service mdwebsite-company3-stage has `max_instances` set to 3.
                Might be worth bumping that up if this alert fires often.
                
                ### HTTP 500s
                This alert fires when the Cloud Run Service is returning many HTTP 500 status codes.
                Currently the alert will fire if the service returns `20` errors in a 5 minute span.
                This can indicate issues with the service or a dependency.
            EOT
          + mime_type = "text/markdown"
          + subject   = "Cloud Run: mdwebsite-company3-stage alert"
        }
    }

  # google_monitoring_dashboard.dashboard will be updated in-place
  ~ resource "google_monitoring_dashboard" "dashboard" {
      ~ dashboard_json = jsonencode(
            {
              - displayName = "MD Website Error Monitoring"
              - etag        = "9d28751e74826c36843e3edf71364228"
              - gridLayout  = {
                  - columns = "2"
                  - widgets = [
                      - {
                          - title   = "mdwebsite-company1-prod 500s Count"
                          - xyChart = {
                              - dataSets          = [
                                  - {
                                      - legendTemplate  = "500s Count"
                                      - plotType        = "LINE"
                                      - targetAxis      = "Y1"
                                      - timeSeriesQuery = {
                                          - timeSeriesFilter = {
                                              - aggregation = {
                                                  - alignmentPeriod  = "60s"
                                                  - perSeriesAligner = "ALIGN_SUM"
                                                }
                                              - filter      = "metric.type=\"logging.googleapis.com/user/mdwebsite-company1-prod-500s\""
                                            }
                                          - unitOverride     = "count"
                                        }
                                    },
                                ]
                              - timeshiftDuration = "0s"
                              - yAxis             = {
                                  - label = "Count"
                                  - scale = "LINEAR"
                                }
                            }
                        },
                      - {
                          - alertChart = {
                              - name = "projects/still-tower-474715-c6/alertPolicies/16149345700725966467"
                            }
                          - title      = "mdwebsite-company1-prod Alert Status"
                        },
                      - {
                          - title   = "mdwebsite-company1-stage 500s Count"
                          - xyChart = {
                              - dataSets          = [
                                  - {
                                      - legendTemplate  = "500s Count"
                                      - plotType        = "LINE"
                                      - targetAxis      = "Y1"
                                      - timeSeriesQuery = {
                                          - timeSeriesFilter = {
                                              - aggregation = {
                                                  - alignmentPeriod  = "60s"
                                                  - perSeriesAligner = "ALIGN_SUM"
                                                }
                                              - filter      = "metric.type=\"logging.googleapis.com/user/mdwebsite-company1-stage-500s\""
                                            }
                                          - unitOverride     = "count"
                                        }
                                    },
                                ]
                              - timeshiftDuration = "0s"
                              - yAxis             = {
                                  - label = "Count"
                                  - scale = "LINEAR"
                                }
                            }
                        },
                      - {
                          - alertChart = {
                              - name = "projects/still-tower-474715-c6/alertPolicies/7262823815928818523"
                            }
                          - title      = "mdwebsite-company1-stage Alert Status"
                        },
                      - {
                          - title   = "mdwebsite-company2-prod 500s Count"
                          - xyChart = {
                              - dataSets          = [
                                  - {
                                      - legendTemplate  = "500s Count"
                                      - plotType        = "LINE"
                                      - targetAxis      = "Y1"
                                      - timeSeriesQuery = {
                                          - timeSeriesFilter = {
                                              - aggregation = {
                                                  - alignmentPeriod  = "60s"
                                                  - perSeriesAligner = "ALIGN_SUM"
                                                }
                                              - filter      = "metric.type=\"logging.googleapis.com/user/mdwebsite-company2-prod-500s\""
                                            }
                                          - unitOverride     = "count"
                                        }
                                    },
                                ]
                              - timeshiftDuration = "0s"
                              - yAxis             = {
                                  - label = "Count"
                                  - scale = "LINEAR"
                                }
                            }
                        },
                      - {
                          - alertChart = {
                              - name = "projects/still-tower-474715-c6/alertPolicies/13742897250207337517"
                            }
                          - title      = "mdwebsite-company2-prod Alert Status"
                        },
                      - {
                          - title   = "mdwebsite-company2-stage 500s Count"
                          - xyChart = {
                              - dataSets          = [
                                  - {
                                      - legendTemplate  = "500s Count"
                                      - plotType        = "LINE"
                                      - targetAxis      = "Y1"
                                      - timeSeriesQuery = {
                                          - timeSeriesFilter = {
                                              - aggregation = {
                                                  - alignmentPeriod  = "60s"
                                                  - perSeriesAligner = "ALIGN_SUM"
                                                }
                                              - filter      = "metric.type=\"logging.googleapis.com/user/mdwebsite-company2-stage-500s\""
                                            }
                                          - unitOverride     = "count"
                                        }
                                    },
                                ]
                              - timeshiftDuration = "0s"
                              - yAxis             = {
                                  - label = "Count"
                                  - scale = "LINEAR"
                                }
                            }
                        },
                      - {
                          - alertChart = {
                              - name = "projects/still-tower-474715-c6/alertPolicies/6285423501025501890"
                            }
                          - title      = "mdwebsite-company2-stage Alert Status"
                        },
                    ]
                }
              - name        = "projects/977121712073/dashboards/26322def-0498-4ec9-bbf2-2634c0e6ca06"
            }
        ) -> (known after apply)
        id             = "projects/977121712073/dashboards/26322def-0498-4ec9-bbf2-2634c0e6ca06"
        # (1 unchanged attribute hidden)
    }

  # google_project_iam_member.gar-reader["company3-prod"] will be created
  + resource "google_project_iam_member" "gar-reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-cloudrun-company3-prod@still-tower-474715-c6.iam.gserviceaccount.com"
      + project = "still-tower-474715-c6"
      + role    = "roles/artifactregistry.reader"
    }

  # google_project_iam_member.gar-reader["company3-stage"] will be created
  + resource "google_project_iam_member" "gar-reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-cloudrun-company3-stage@still-tower-474715-c6.iam.gserviceaccount.com"
      + project = "still-tower-474715-c6"
      + role    = "roles/artifactregistry.reader"
    }

  # google_project_iam_member.secret-reader["company3-prod"] will be created
  + resource "google_project_iam_member" "secret-reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-cloudrun-company3-prod@still-tower-474715-c6.iam.gserviceaccount.com"
      + project = "still-tower-474715-c6"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_project_iam_member.secret-reader["company3-stage"] will be created
  + resource "google_project_iam_member" "secret-reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-cloudrun-company3-stage@still-tower-474715-c6.iam.gserviceaccount.com"
      + project = "still-tower-474715-c6"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # google_pubsub_topic_iam_member.pubsub-publisher["company3-prod"] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub-publisher" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-cloudrun-company3-prod@still-tower-474715-c6.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = "mdconversions-prod"
    }

  # google_pubsub_topic_iam_member.pubsub-publisher["company3-stage"] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub-publisher" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-cloudrun-company3-stage@still-tower-474715-c6.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = "mdconversions-stage"
    }

  # google_secret_manager_secret.secret-sauce["company3"] will be created
  + resource "google_secret_manager_secret" "secret-sauce" {
      + create_time           = (known after apply)
      + deletion_protection   = true
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "still-tower-474715-c6"
      + secret_id             = "company3-secret-sauce"
      + terraform_labels      = (known after apply)

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-central1"
                }
            }
        }
    }

  # google_service_account.md-website["company3-prod"] will be created
  + resource "google_service_account" "md-website" {
      + account_id   = "sa-cloudrun-company3-prod"
      + disabled     = false
      + display_name = "SA for Cloud Run Service: company3-prod"
      + email        = "sa-cloudrun-company3-prod@still-tower-474715-c6.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-cloudrun-company3-prod@still-tower-474715-c6.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "still-tower-474715-c6"
      + unique_id    = (known after apply)
    }

  # google_service_account.md-website["company3-stage"] will be created
  + resource "google_service_account" "md-website" {
      + account_id   = "sa-cloudrun-company3-stage"
      + disabled     = false
      + display_name = "SA for Cloud Run Service: company3-stage"
      + email        = "sa-cloudrun-company3-stage@still-tower-474715-c6.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-cloudrun-company3-stage@still-tower-474715-c6.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "still-tower-474715-c6"
      + unique_id    = (known after apply)
    }

  # google_storage_bucket.mdconversions["company3-prod"] will be created
  + resource "google_storage_bucket" "mdconversions" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "mdconversions-company3-prod"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 7
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
    }

  # google_storage_bucket.mdconversions["company3-stage"] will be created
  + resource "google_storage_bucket" "mdconversions" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "mdconversions-company3-stage"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 7
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
    }

  # google_storage_bucket_iam_member.gcs-reader["company3-prod"] will be created
  + resource "google_storage_bucket_iam_member" "gcs-reader" {
      + bucket = "mdconversions-company3-prod"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:sa-cloudrun-company3-prod@still-tower-474715-c6.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.gcs-reader["company3-stage"] will be created
  + resource "google_storage_bucket_iam_member" "gcs-reader" {
      + bucket = "mdconversions-company3-stage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:sa-cloudrun-company3-stage@still-tower-474715-c6.iam.gserviceaccount.com"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.md-converter-gcs-reader["company3-prod"] will be created
  + resource "google_storage_bucket_iam_member" "md-converter-gcs-reader" {
      + bucket = "mdconversions-company3-prod"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:sa-cf-md-converter-prod@still-tower-474715-c6.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

  # google_storage_bucket_iam_member.md-converter-gcs-reader["company3-stage"] will be created
  + resource "google_storage_bucket_iam_member" "md-converter-gcs-reader" {
      + bucket = "mdconversions-company3-stage"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:sa-cf-md-converter-stage@still-tower-474715-c6.iam.gserviceaccount.com"
      + role   = "roles/storage.objectCreator"
    }

Plan: 23 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ run_services_prod  = "company1-prod,company2-prod" -> "company1-prod,company2-prod,company3-prod"
  ~ run_services_stage = "company1-stage,company2-stage" -> "company1-stage,company2-stage,company3-stage"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @tony-ebel, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*